---
kind: property
id: P:Autodesk.Revit.DB.DefaultOpenFromCloudCallback.IsValidObject
source: html/c1531957-723b-dd77-bf3b-0e8e6c8fd470.htm
---
# Autodesk.Revit.DB.DefaultOpenFromCloudCallback.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.